INSERT INTO genres(name)
VALUES ('Рок'), ('Пост Панк'), ('Панк Рок'), ('Рэп'), ('Инди Рок');

INSERT INTO performers(name)
VALUES ('Сплин'), ('Кино'), ('Порнофильмы'), ('Руна'), ('Вещие Ослы'), ('Йорш'), ('Раскольников'), ('Индульгенция');

INSERT INTO albums(name, year)
VALUES ('Ритуалы', '2018-01-10'), ('Звезда по имени Солнце', '1989-04-29'), ('Сигнал из космоса', '2009-11-20'),
       ('Полюса', '2015-05-05'), ('Живые Игрушки', '2017-03-03'), ('Случилось страшное', '2020-05-05'),
       ('Ищущий да обрящет', '2016-04-04'), ('Экстремистские песни', '2021-01-04');

INSERT INTO tracks(name, duration, album_id)
VALUES ('Ритуалы', 282, 1), ('Звезда по имени Солнце', 225, 2), ('Пачка сигарет', 268, 2),  ('Сказка', 360, 2),
       ('Вальс', 187, 3), ('Мой чердак', 247, 3), ('Полюса', 192, 4), ('Живые Игрушки', 169, 5), ('Моя вещая птица', 288, 6),
       ('Давануло', 279, 6), ('Любила', 171, 6), ('Между небом и землей', 241, 6), ('Свидетельство о смерти', 207, 6),
       ('Ищущий да обрящет', 284, 7), ('Экстремистские песни', 229, 8), ('Назад', 240, 6);

INSERT INTO collections(name, year)
VALUES ('Русский Рок', '2020-04-04'), ('Грязный Панк', '2019-01-01'),  ('Подумать обо всем', '2022-11-11'),
       ('Жесткий рэп', '2017-02-20'), ('Вспомнить былое', '2019-09-01'), ('Быть крутым', '2023-01-01'),
       ('Что-то новое', '2018-10-10'), ('Микс', '2021-01-03');

INSERT INTO performers_albums(performer_id, album_id)
VALUES (1, 3), (2, 2), (3, 1), (4, 4), (5, 6), (6, 5), (7, 7), (8, 7);

INSERT INTO performers_genres(performer_id, genre_id)
VALUES (1, 5), (1, 2), (1, 1), (2, 1), (2, 2), (3, 3), (3, 1), (4, 1), (4, 2), (5, 1), (5, 5), (6, 1), (6, 3),
       (7, 4), (8, 1), (8, 3), (8, 5);

INSERT INTO collections_tracks(collection_id, track_id)
VALUES (1, 1), (1, 2), (1, 3), (1, 4), (1, 5), (1, 6), (1, 7), (1, 10), (1, 11),
       (2, 9), (2, 10), (2, 11), (2, 12), (2, 13),
       (3, 1), (3, 2), (3, 3), (3, 4), (3, 5), (3, 6), (3, 7),
       (4, 14),
       (5, 2), (5, 3), (5, 4),
       (6, 1), (6, 14), (6, 15),
       (7, 9), (7, 10), (7, 11), (7, 12), (7, 13), (7, 15),
       (8, 1), (8, 3), (8, 5), (8, 7), (8, 9), (8, 11), (8, 13), (8, 15),
       (16, null);